app/controllers/creatures_controller.rb

  def index
    #get all creatures from db and save to instance variable
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

  def create
    #whitelist params and save them to variable
    creature_params = params.require(:creature).permit(:name, :description)
    #create a new creature from creature_params
    creature = Creature.new(creature_params)

    #if creatures saves, redirecte to route that displays all creatures
    if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fdsaf"], ["description", "fdsafdsa"], ["created_at", "2016-04-30 23:42:05.307766"], ["updated_at", "2016-04-30 23:42:05.307766"]]

  def show
    #get the creature id from the url params
    creature_id = params[:id]
    #use "creature_id" to find the creature in the database
    #and save it to an instance var
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 9]]

  def edit
    #get the creature id from the url params
    creature_id = params[:id]
    #use "creature_id" to find the creature in the db
    #and save it to an instance var
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 3]]

  def update
    #get creature id from url params
    creature_id = params[:id]

    #use id var to find creature in db and save to instance var
    creature = Creature.find_by_id(creature_id)

    #whitelist params and save them to var
    creature_params = params.require(:creature).permit(:name, :description)

    #update creature
    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["description", "Jedipoo"], ["updated_at", "2016-05-01 00:36:15.117701"], ["id", 1]]

  def destroy
    # get creature id from url params
    creature_id = params[:id]
    #use creature_id to find the creature in the db and save to inst. var
    creature = Creature.find_by_id(creature_id)
    #destroy creature
    creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 2]]